kenvinh/ch554_sdcc/examples/usb_device_hid/USB.c
/********************************** (C) COPYRIGHT ******************************
* File Name          :USB.C												
* Author             :QITAS                                                      
* Version            : V1.0                                                  
* Date               : 2018/06/05                                               
* Description        : A demo for USB compound device created by CH554, support 
					   keyboard , and HID-compliant device.                     
********************************************************************************/
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include <ch554.h>
#include <ch554_usb.h>
#include <debug.h>

#define		L_WIN 					0x08
#define 	L_ALT 					0x04
#define		L_SHIFT					0x02
#define 	L_CTL					0x01
#define 	R_WIN 					0x80
#define 	R_ALT 					0x40
#define 	R_SHIFT					0x20
#define 	R_CTL					0x10
#define 	SPACE					0x2C
#define		ENTER					0x28

#define MOUSE 0

#define 	THIS_ENDP0_SIZE         DEFAULT_ENDP0_SIZE
#define		BUFFER_SIZE				64
#define 	DUAL_BUFFER_SIZE		128
#define 	UsbSetupBuf     		((PUSB_SETUP_REQ)Ep0Buffer)

__xdata __at (0x0000) uint8_t  Ep0Buffer[THIS_ENDP0_SIZE];  								// Endpoint 0, buffer OUT/OUT��the address must be even.
__xdata __at (0x000A) uint8_t  Ep1Buffer[BUFFER_SIZE];  								// Endpoint 1, buffer IN��the address must be even.
__xdata __at (0x0050) uint8_t  Ep2Buffer[DUAL_BUFFER_SIZE];  								// Endpoint 2, buffer OUT[64]+IN[64]��the address must be even.
 
/**************************** Global variable ********************************/	
uint8_t   volatile	SetupReq, SetupLen, UsbConfig;
uint8_t	volatile	EnumOK, FLAG;
const uint8_t * pDescr;                                                                		// USB enumerate complete flag.
USB_SETUP_REQ  		SetupReqBuf;                                   					// A buffer for Setup package.

uint8_t HIDKey[8] = {0};
uint8_t TXflag = 0;
uint8_t RXflag = 0;


/**************************** Device Descriptor *************************************/
__code uint8_t DevDesc[18] = {																// Device Descriptor
	0x12,0x01,                                                                      // bLength | bDescriptorType (constant 0x01)
	0x10,0x01,                                                                      // bcdUSB (2 bytes)
	0x00,0x00,                                                                      // bDeviceClass | bDeviceSubClass
	0x00,0x08,                                                                      // bDeviceProtocol | bMaxPacketSize
    
	0x31,0x51,																		// Vendor ID   |  VID =  0X5131///413c
	0x07,0x20,																		// Product ID  |  PID = 0X2007 /// 2105
//	0x00,0x01,
//	0x05,0x21,

	0x00,0x11,																		// bcdDevice		
	0x00,0x00,                                                                      // iManufacturer | iProduct
	0x00,0x01                                                                       // iSerialNumber | bNumConfigurations
};
/**************************** HID Report Descriptor *********************************/
__code uint8_t KeyRepDesc[65] = 															// Report Descriptor, DELL Keyboard
{
	0x05, 0x01, 		// Usage page Generatic Desktop
	0x09, 0x06, 		// Usage keyboard
	0xa1, 0x01, 		// Collation Application
	0x05, 0x07, 		// Usafe page (key code)
	0x19, 0xe0, 		// Usage Min ( E0 -->  L_CTL)
	0x29, 0xe7, 		// Usage MAX ( E7 --> R_GUI )
	0x15, 0x00, 		// Logical min
	0x25, 0x01, 		// Logical max
	0x95, 0x08, 		// Report count ( 8 )
	0x75, 0x01, 		// Report size	( 1 )
	0x81, 0x02, 		// Input ( Data, Variable, Absolute )

	0x95, 0x08, 		// Report count ( 8 )
	0x75, 0x01, 		// Report size	( 1 )
	0x81, 0x01, 		// Input ( const )

	0x05, 0x08, 		// Usage page( LED )
	0x19, 0x01, 		// Usage min ( 1 )
	0x29, 0x03, 		// Usage max ( 3 )
	0x95, 0x03, 		// Report count ( 3 )
	0x75, 0x01, 		// Report size ( 1 )
	0x91, 0x02, 		// Output ( Data, Variable, Absolute )
	0x95, 0x01, 		// Report count ( 1 )
	0x75, 0x05, 		// Report size ( 5 )
	0x91, 0x01, 		// Output ( const )
	0x05, 0x07, 		// Usage page ( key code )
	0x19, 0x00, 		// Usage min ( 0H )
	0x2a, 0xff, 0x00,	// Usage max ( FFH )
	0x15, 0x00,			// Logical min ( 0H )
	0x26, 0xff, 0x00,	// Logical max ( FFH )
	0x95, 0x06, 		// Report count ( 6 )
	0x75, 0x08, 		// Report size ( 8 )
	0x81, 0x00, 		// Input ( Data, Array, Absolute )
	0xc0				// End collection
};

__code uint8_t ComRepDesc[34] = 															// Report Descriptor, Composite device
{
	0x06, 0x00, 0xff, 	// Usage page Vendor defined
	0x09, 0x01, 		// Usage keyboard
	0xa1, 0x01, 		// Collation Application
	0x09, 0x02, 		// Mouse
	0x15, 0x00, 		// Logical min ( 0H )
	0x26, 0x00, 0xff,	// Logical max ( FFH )
	0x75, 0x08,  		// Report size ( 08H )
	0x95, 0x40, 		// Report count ( 40H )
	0x81, 0x06,  		// Input ( Data, Relative, Wrap )
	0x09, 0x02, 		// Mouse
	0x15, 0x00,  		// Logical min ( 0H )
	0x26, 0x00, 0xff,	// Logical max ( FFH )
	0x75, 0x08, 		// Report size ( 08H )
	0x95, 0x40, 		// Report count ( 40H )
	0x91, 0x06, 		// Output ( Data, Relative, Wrap )
	0xc0,
};

// ����������

__code uint8_t CfgDesc[9+9+9+7+9+9+7+7] =
{
    0x09,0x02,0x42,0x00,0x02,0x01,0x00,0xA0,0x32,             						// Configure Descriptor
//   blen type  tlen     interface   
//	0x09,0x02,0x22,0x00,0x01,0x01,0x00,0xA0,0x32,

	0x09,0x04,0x00,0x00,0x01,0x03,0x01,0x01,0x00,             						// Interface Descriptor, keyboard
    0x09,0x21,0x11,0x01,0x00,0x01,0x22,sizeof(KeyRepDesc),0x00,             		// HID Descriptor
    0x07,0x05,0x81,0x03,0x08,0x00,0x0a,                       						// Endpoint Descriptor, 50ms

//  0x09,0x02,0x29,0x00,0x01,0x01,0x00,0xA0,0x32,             						// Configure Descriptor	

//  0x09,0x04,0x00,0x00,0x02,0x03,0x00,0x00,0x00,             						// Interface Descriptor, Composite device�� 2 EPs
	0x09,0x04,0x01,0x00,0x02,0x03,0x00,0x00,0x00,             						// Interface Descriptor, Composite device�� 2 EPs
    0x09,0x21,0x10,0x01,0x21,0x01,0X22,sizeof(ComRepDesc),0x00,             		// HID Descriptor
    0x07,0x05,0x82,0x03,0x40,0x00,0x32,                        						// Endpoint Descriptor, 10ms, IN
	0x07,0x05,0x02,0x03,0x40,0x00,0x0a												// Endpoint Descriptor,	10ms, OUT
};

// ����������
__code uint8_t	MyLangDescr[] = { 0x04, 0x03, 0x09, 0x04 };
// ������Ϣ
__code uint8_t	MyManuInfo[] = { 0x0E, 0x03, 'w', 0, 'c', 0, 'h', 0, '.', 0, 'c', 0, 'n', 0 };
// ��Ʒ��Ϣ
__code uint8_t	MyProdInfo[] = { 0x0C, 0x03, 'C', 0, 'H', 0, '5', 0, '5', 0, '2', 0 };

